/*
 *  Информация о государствах мира
 */
const about = ["Государство", "Столица", "Континент", "Часть света", "Разница во времени",
    "Денежная единица", "Географические объекты", "Литературные произведения",
    "Исторические события"];

const countriess = [
    ["Италия", "Рим", "Евразия", "Европа", -2, "итальянская лира",
        ["Альпы", "Пальмария", "Апеннинский полуостров", "Комо", "Тальяменто"],
        [["Джованни Верга", "Жизнь среди полей", 1880], ["Анна Виванти", "Цирцея", 1912], ["Джузеппе Понтиджа", "Рождённые дважды", 2000]],
        {"1882": "избирательная реформа", "1945": "антифашистское восстание, 18-28 апреля"}
    ],
    [["Эндр", "Пиренеи", "Луара", "Альпы", "Бискайский залив"],
        "Франция", -1, "Париж", "Евразия", "Европа", "евро",
        [["Александр Дюма", "Граф Монте-Кристо", 1845], ["Жюль Габриэль Верн", "Завещание чудака", 1900], ["Луи Анри Буссенар", "Капитан Сорви-голова", 2001], ["Морис Самюэль Роже Шарль Дрюон", "Тисту — мальчик с зелеными пальцами", 1957]],
        {"1572": "Варфоломеевская ночь", "1648": "Вестфальский мир", "1914": "Марнское сражение, 5-12 сентября"}
    ],
    [[["Иоханна Спири", "Хайди: годы странствий и учёбы", 1880], ["Герман Гессе", "Игра в бисер", 1942], ["Макс Фриш", "Homo Фабер", 1957], ["Мелинда Надь Абонджи", "Голуби взлетают", 2010]],
        "Швейцария", "отсутствует", "Евразия", "Европа", -1, "Швейцарский франк",
        ["Бильское озеро", "Рейхенбахский водопад", "Альпы", "Алечский ледник"],
        {"1291": "основание Швейцарии", "1844": "начало работы первой железнодорожной линией"}
    ],
    ["Венгрия", "Будапешт", "Евразия", "Европа", -1, ["Геллерт", "Карпаты", "Веленце", "Мезёфёльд"],
        "Венгерский форинт",
        [["Янош Бачаньи", "Мужество венгров", 1785], ["Аттила Бартиш", "Спокойствие", 2001], ["Ийеш Дьюла", "Двое мужчин", 1950]],
        {
            "1222": "подписание Эндре II «Золотой буллы»",
            "1867": "Коронование Франца-Иосифа в Будапеште по старым обычаям, 8 июня"
        }
    ],
    ["Румыния", "Бухарест", "Евразия", "Европа", "Румынский лей",
        ["Олт", "Трансильванское плато", "Карпаты", "Медвежья пещера", "Бабеле"], 0,
        {
            "1881": "Румыния была провозглашена королевством",
            "1990": "первые свободные президентские и парламентские выборы",
            "2004": "Румыния стала членом НАТО"
        },
        [["Михаил Садовяну", "Золотая ветвь", 1933], ["Мирча Элиаде", "Изабель и воды дьявола", 1930]]
    ],
    ["Япония", "Токио", "Евразия", "Азия",
        ["Фудзияма", "Сакурадзима", "Абукума"],
        [["Сюсаку Эндо", "Море и яд", 1958], ["Юдзо Ямамото", "Профессор Цумура", 1919], ["Марико Хасиока", "Аут", 1997]],
        {
            "1872": " отменена сложного и строгого сословного деления",
            "1904": "японский флот атаковал русскую эскадру в Порт-Артуре",
            "1941": "атака на Пёрл-Харбор"
        },
        6, "японская иена"
    ],
    [1.5, "Афганистан", "Кабул", "Евразия", "Азия", "афгани",
        [["Гуль Пача Ульфат", "Голос сердца", 1962], ["Абдуррауф Бенава", "Горестные размышления", 1957], ["Махмуд-бек Тарзи", "Путешествия через три континента за 29 дней", 1914]],
        {
            "1973": "провозглашение Республики, 17 июля",
            "2004": "новая Конституция и проведены первые президентские выборы"
        },
        ["Намакзар", "Дашти-Марго", "Фарахруд", "Гиндукуш"]
    ],
    [{
        "1857": "Восстание Сипаев",
        "1617": "Британская Ост-Индская компания получила право торговать с Индией",
        "1948": "Операция «Поло»",
        "1986": "архитектурное наследие Хампи включено в список Всемирного наследия"
    },
        "Индия", "Нью-Дели", "Евразия", "Азия", 2.5, "Индийская рупия",
        ["Ганг", "Гуру-Сикар", "Дудхсагар", "Цо-Морари", "Деканские траппы"],
        [["Арундати Рой", "Бог мелочей", 1997], ["Хушвант Сингх", "Поезд в Пакистан", 1956]]
    ],
    ["Бразилия", "Бразилиа", "Южная Америка", "Америка", -6, "риал",
        ["Тапажос", "Пантанал", "пампа", "Сейшас", "Параноа"],
        [["Лима Баррето", "Жалкий конец Поликарпо Кваресма", 1911], ["Эрику Верисиму", "Происшествие в Антаресе", 1971], ["Шику Буарки", "Будапешт ", 2003], ["Жоаким Мануэл ди Маседу", "Смуглянка", 1844]],
        {
            "1888": "Золотой закон об отмене рабства в Бразилии, 13 мая",
            "1935": "вооружённое выступление бразильских коммунистов и тенентистов"
        }
    ],
    [["Фанди", "Подкова", "Элсмир", "Невольничье озеро", "Оттава"],
        [["Филип Майкл Ондатже", "Английский пациент", 1992], ["Маргарет Этвуд", "Up In The Tree", 1978]],
        "Канада", "Оттава", "Северная Америка", "Америка", -7, "канадский доллар",
        {
            "1608": "основание города Квебек",
            "1838": "Битва за ветряную мельницу",
            "1867": "Канада получила право формировать собственное правительство"
        }
    ],
    ["Аргентина", "Буэнос-Айрес", "Южная Америка", "Америка", -6, "аргентинское песо",
        [["Хорхе Луис Борхес", "Фунес памятливый", 1942]],
        ["Охос-дель-Саладо", "Огненная земля", "Пампа", "Лагунас-де-Гуанакаче"],
        {
            "1912": "закон о всеобщем избирательном праве",
            "1871": "Завоевание пустыни",
            "1810": "Аргентинская война за независимость"
        }
    ],
    [["Кристобаль-Колон", "Магдалена", "Каука", "Анды", "Льянос"],
        [["Рафаэль Помбо", "Флибустьеры", 1856], ["Хосе Эустасио Ривера", "Вихрь", 1924], ["Лаура Рестрепо", "Леопард на солнце", 1993]],
        "Колумбия", "Богота", "Южная Америка", "Америка", -8, "колумбийское песо",
        {
            "1916": "обнаружены богатейшие запасы нефти",
            "1549": "образование королевской аудиенсии и канцелярии Санта-Фе де Боготы",
            "1886": "принята консервативная конституция"
        }
    ],
    ["Англия", "Лондон", "", "", -3, "фунт стерлингов",
        ["Тис", "Белые клифы Дувра", "Саут-Даунс", "Скофелл-Пайк"],
        {
            "1701": "Акт о престолонаследии",
            "1455": "начало войны Алой и Белой розы",
            "1215": "Великая хартия вольностей"
        },
        [["Майн Рида", "Огненная земля", 1883], ["Уильям Шекспир", "Ромео и Джульетта", 1595], ["Оскар Уайльд", "Портрет Дориана Грея", 1891], ["Джонатан Свифт", "Путешествия в некоторые удалённые страны мира в четырёх частях: сочинение Лемюэля Гулливера, сначала хирурга, а затем капитана нескольких кораблей", 1726]]
    ],
    ["Мексика", "Мехико", "Южная Америка", "Америка", -9, "мексиканское песо",
        {
            "1810": "Мексиканская война за независимость",
            "1536": "открытие коллегиума Санта-Крус де Тлателолько",
            "2006": "Революция кактусов"
        },
        ["Попокатепетль", "Калифорния", "Эль-Вискаино", "Сонора", "Чапала", "Гуадалупе", "Пещера Ласточек"],
        [["Октавио Пас", "Salamandra", 1962], ["Амадо Нерво", "Недвижная возлюбленная", 1922], ["Карлос Фуэнтес", "Смерть Артемио Круса", 1962], ["Хуан Рульфо", "Педро Парамо", 1955]]
    ]
];

let count = 1;

function outArrayData(array) {
    let tab = `<tr style="width: 100%; align-items: center"">`;

    if (Array.isArray(array)) {
        tab = `<tr style="width: 100%; align-items: center"">`;
        let str = array[0] + ' "' + array[1] + '" ' + array[2];
        if (count === 1) {
            tab += `<td class="left_text" style="padding: 10px 10px 0 0;">${about[7] + ':'}</td>
                                <td class="right_text" style="padding-top: 17px;"><div class="span">${count}</div>${str}</td>`
        }
        else {
            tab += `<td class="left_text"></td><td class="right_text"><div class="span">${count}</div>${str}</td>`;
        }
    } else {
        if (count === 1) {
            tab += `<td class="left_body" style="padding: 10px 10px 0 0;">${about[6] + ':'}</td>
                                <td class="right_body" style="padding-top: 17px;"><div class="span">${count}</div>${array}</td>`
        }
        else {
            tab += `<td class="left_body"></td><td class="right_body"><div class="span">${count}</div>${array}</td>`;
        }
    }
    tab += "</tr>";
    count++;

    return tab;

}




function makeTableFromCountry (country) {
    let tab = "<table width='100%'>";


    /* sort */
    let maps = new Map()
    let index = 0;
    for (let i = 0; i < country.length; i++) {

        if (country[i][0] instanceof Array) {
            maps.set(7, country[i]);
        }
        else if (country[i] instanceof Array) {
            maps.set(6, country[i]);
        }
        else if (Number.isInteger(country[i]) || String(parseFloat(country[i])) === String(country[i])) {
            maps.set(4, country[i]);
        }
        else if (country[i] instanceof Object) {
            maps.set(8, country[i]);
        }

        else {
            if (index == 4) {
                index++;
            }
            maps.set(index, country[i]);
            index++;
        }
    }

    for (let i = 0; i < country.length; i++) {
        country[i] = maps.get(i);
    }

    console.log(country);


    /* header */
    // tab += `<thead class="main"><tr><th colspan="2"><h1>${country[0] + '-' + country[1]}</h1></th></tr></thead>`
    tab += `<caption class="main"><h1>${country[0] + '-' + country[1]}</h1></caption>`


    /* body */
    tab += "<tbody>"
    for (let i = 2; i < 6; i++) {
        tab += `<tr style="width: 75%; align-items: center""><td class="left_header">${about[i]}</td>
                                                        <td class="right_header">${country[i]}</td></tr>`
    }

    count = 1;
    console.log(country[6]);
    let oneObg = country[6].map(outArrayData);
    oneObg.map(item => tab += item);

    count = 1;
    console.log(country[7]);
    oneObg = country[7].map(outArrayData);
    oneObg.map(item => tab += item);
    tab += "</tbody>"

    /* body_2 */
    tab += "<table width='100%' style='padding-top: 10px;'>"
    tab += `<caption style="text-align: center; padding-top: 10px;"><b>${about[8]}</b></caption>`
    tab += "<tr>"
    for (const obj in country[8]) {
        tab += `<td style="border: 1px solid black;"><strong>${obj}</strong> ${country[8][`${obj}`]}</td>`
    }
    tab += "</tr></table>"


    tab += "</tbody></table>"
    return tab;
}


// show_arr = countries.map(makeTableFromCountry);
// const div = document.querySelector("#main");
// show_arr.forEach(function (info, i, arr) {
//    div.innerHTML += (info + "<br>");
// });
// show_arr.forEach(table => div.innerHTML += table);

const div = document.querySelector("#main");
let output;

let obj1 = {
    countries: countriess.slice(),
    name: "obj1",
    outCountries:
        function () {
            console.log(this.name);
            output = this.countries.map(makeTableFromCountry);
            output.forEach(function (info, i, arr) {
                div.innerHTML += (info + "<br>");
            });

            div.innerHTML += "<p style='border: 35px solid black;'></p>"
        }
}

function Changes () {

}

Array.prototype.includes = function (data) {
    let found;
    for (let i = 0; i < this.length; i++) {
        if (this[i][0] instanceof Array) {
            continue;
        }
        else if (this[i] instanceof Array) {
            found = data.some(r => this[i].indexOf(r) >= 0);
            break;
        }
    }
    return found;
}

let obj2 = new Changes();
obj2 = {
    countries: countriess.slice(),
    name: "obj2",
    changeCountries:
        function (data_1, data_2) {
            console.log(this.name);
            let data = [];
            data.push(data_1);
            data.push(data_2);
            for (let country in this.countries) {
                let isData = this.countries[country].includes(data);
                if (!isData) {
                    delete this.countries[country];
                }
            }
        }
}

// Пункт а
obj1.outCountries();

// Пункт б
obj1.outCountries.apply(obj2);

// Пункт в
obj2.changeCountries.apply(obj1, ['Альпы', 'Карпаты']);

// Пункт г
obj1.outCountries();

// Пункт д
obj1.outCountries.apply(obj2);

document.body.appendChild(div);